Revit 2027 API
BaseArray.GetCopiedMemberIds Method
Retrieves the copied member Ids of the Array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract ICollection<ElementId> GetCopiedMemberIds()
Public MustOverride Function GetCopiedMemberIds As ICollection(Of ElementId)
public:
virtual ICollection<ElementId^>^ GetCopiedMemberIds() abstract
abstract GetCopiedMemberIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The copied member Ids of the Array
See Also
Reference
BaseArray Class
Autodesk.Revit.DB Namespace